# Series 형 데이터

In [2]:
import pandas as pd

In [1]:
odd = [i for i in range(1, 10, 2)]
odd

[1, 3, 5, 7, 9]

In [4]:
pd_odd = pd.Series(odd)
pd_odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [5]:
pd_odd.mean()

5.0

In [6]:
pd_odd.describe()

count    5.000000
mean     5.000000
std      3.162278
min      1.000000
25%      3.000000
50%      5.000000
75%      7.000000
max      9.000000
dtype: float64

# DataFrame

In [8]:
numbers = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
numbers = pd.DataFrame(numbers)
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

# 1-5 Series 와 DataFrame의 관계

In [9]:
type(numbers)

pandas.core.frame.DataFrame

In [10]:
type(numbers[0])

pandas.core.series.Series

DataFrame은 여러개의 Series로 이루어져있다.

# 1-6 Pandas Data Type

In [13]:
odd = [i for i in range(1, 10, 2)]
odd = pd.Series(odd)

odd.dtypes

dtype('int64')

In [15]:
# 내부요소가 하나만 float형이라면 모두 float형으로 간주한다.

arr = [1, 2, 3, 5.0, 6]
arr = pd.Series(arr)

arr.dtypes

dtype('float64')

# 1-7 NaN(Not a Number)

In [4]:
import numpy as np
import pandas as pd

odd = [1, np.nan, 5, 7, 90]

odd = pd.Series(odd)

odd.dtypes

# nan은 float형으로 나온다.

dtype('float64')

In [5]:
type(np.nan)

float

현업에서는 nan을 -1로 저장하는 경우도 있는데,데이터 저장은 용이할수있지만 분석에서는 통계치가 왜곡되는 문제가 생길 수 있다.

In [7]:
np.nan == np.nan # nan끼리는 비교할수가없다.

False

nan의 경우 별도처리를 해야할 경우가 있지 ㅎㅋ

In [9]:
val = np.nan

print(pd.isnull(val))

print(pd.notnull(val))

True
False

# 1-8 DataFrame을 새로 생성하는 방법

## 생성하기

In [11]:
# rank가 2인 리스트를 데이터프레임으로 변형할 수 있지만
# 컬럼 이름을 바로 수정할 수 없고, 불편하기 때문에 자주 쓰이지는 않는다.

order = [
    ["2017-01-02", 300, "confirmed"],
    ["2017-01-03", 500, "confirmed"],
    ["2017-01-04", 700, "canceled"]
]

order = pd.DataFrame(order)

order

            0    1          2
0  2017-01-02  300  confirmed
1  2017-01-03  500  confirmed
2  2017-01-04  700   canceled

In [3]:
order = [
    ["2017-01-02", 300, "confirmed"],
    ["2017-01-03", 500, "confirmed"],
    ["2017-01-04", 700, "canceled"]
]

columns = ["date", "price", "state"]

order = pd.DataFrame(order, columns = columns)

order

         date  price      state
0  2017-01-02    300  confirmed
1  2017-01-03    500  confirmed
2  2017-01-04    700   canceled

In [15]:
# 딕셔너리형으로 선언해서 DataFrame으로 변형 가능.

order = {
    "data" : ["2017-01-02", "2017-01-03", "2017-01-04"],
    "price" : [300, 500, 700],
    "state" : ["confirmed", "confirmed", "canceled"]
}

order = pd.DataFrame(order)

order

         data  price      state
0  2017-01-02    300  confirmed
1  2017-01-03    500  confirmed
2  2017-01-04    700   canceled

In [4]:
# 리스트 안에 딕셔너리를 선언해서도 DataFrame으로 만들 수 있다.
# 위 방식과 본 방식 모두 유용하고, 위 방식이 pandas에서 권장되는 방식이지만,
# 현업에서 들어오는 데이터 형태는 본 형태가 더 빈번하다.

order = [
    {"date": "2017-01-02", "price" : 300, "state" : "confirmed"},
    {"date": "2017-01-03", "price" : 500, "state" : "confirmed"},
    {"date": "2017-01-04", "price" : 700, "state" : "canceled"}
]

order = pd.DataFrame(order)

order

         date  price      state
0  2017-01-02    300  confirmed
1  2017-01-03    500  confirmed
2  2017-01-04    700   canceled

# 1-9 DataFrame의 기본

In [88]:
order_url = "https://bit.ly/dsa-01-order"

order_url

'https://bit.ly/dsa-01-order'

In [89]:
# pandas 는 주소에 있는 데이터를 바로 불러오는 기능도 제공
# pd.read_csv()

order = pd.read_csv(order_url)

order

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed
5   6        5           7  2017-01-09    600    Busan   canceled
6   7        2           5  2017-01-10    200      NaN   canceled

In [59]:
# 위 데이터를 보면 , id는 유니크하므로 이게 직관적으로 행(인덱스)을 구분하기 쉽다.
# 이렇게 바꿀 수 있다.

order = pd.read_csv(order_url, index_col = "id")

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [91]:
# 똑같은 결과지만 이렇게도 할 수 있다.

order = pd.read_csv(order_url)
order = order.set_index("id")

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [10]:
order.index

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64', name='id')

In [11]:
order.columns

Index(['user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [12]:
order.values

array([[3, 9, '2017-01-01', 500, 'Seoul', 'confirmed'],
       [1, 7, '2017-01-03', 700, 'Seoul', 'confirmed'],
       [3, 8, '2017-01-03', 900, 'Daejeon', 'confirmed'],
       [4, 2, '2017-01-07', 500, nan, 'canceled'],
       [7, 3, '2017-01-09', 700, 'Incheon', 'confirmed'],
       [5, 7, '2017-01-09', 600, 'Busan', 'canceled'],
       [2, 5, '2017-01-10', 200, nan, 'canceled']], dtype=object)

In [13]:
type(order.index)

# 여기서 보면 int62Index라고 나오는데 지금 수준에선 그냥 Series형이라고 생각해라

pandas.core.indexes.numeric.Int64Index

In [14]:
order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [92]:
# 컬럼 이름도 바꿀 수 있다. price --> amount

order.columns = ["user_id", "product_id", "date", "amount", "address", "state"]

order

    user_id  product_id        date  amount  address      state
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [15]:
order.head(2) # n개의 앞 데이터만 슬쩍 보는거

    user_id  product_id        date  price address      state
id
1         3           9  2017-01-01    500   Seoul  confirmed
2         1           7  2017-01-03    700   Seoul  confirmed

In [35]:
order.tail(3) # n개의 뒤 데이터만 슬쩍

    user_id  product_id        date  amount  address      state
id
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [36]:
order['date'].head()

id
1    2017-01-01
2    2017-01-03
3    2017-01-03
4    2017-01-07
5    2017-01-09
Name: date, dtype: object

# 1-10 Pandas의 기본연산

In [18]:
order['amount'].mean()

585.7142857142857

In [38]:
order['amount'].min()

200

In [19]:
order['amount'].describe()

count      7.000000
mean     585.714286
std      219.306266
min      200.000000
25%      500.000000
50%      600.000000
75%      700.000000
max      900.000000
Name: amount, dtype: float64

In [42]:
order['state']

id
1    confirmed
2    confirmed
3    confirmed
4     canceled
5    confirmed
6     canceled
7     canceled
Name: state, dtype: object

In [44]:
# 여기서 state의 종류가 몇개나 되는지 알고싶으면 unique() 함수를 쓰자.

order['state'].unique()

array(['confirmed', 'canceled'], dtype=object)

In [46]:
# 그럼 confirmed와 canceled의 갯수를 세어보고 싶다.
# 생소하지만 요긴한 함수

order['state'].value_counts()

confirmed    4
canceled     3
Name: state, dtype: int64

In [48]:
# 그럼 전체에서 차지하는 비율은 얼마나 될까를 따져보는 것

order['state'].value_counts(normalize=True)

confirmed    0.571429
canceled     0.428571
Name: state, dtype: float64

# 1-11 Pandas 기본연산2

In [49]:
order['state']

# 여기서 confirmed --> confirm으로 바꾸고
# canceled --> cancel로 바꾸자

id
1    confirmed
2    confirmed
3    confirmed
4     canceled
5    confirmed
6     canceled
7     canceled
Name: state, dtype: object

In [93]:
order['state'].replace('confirmed','confirm').replace("canceled", "cancel")

id
1    confirm
2    confirm
3    confirm
4     cancel
5    confirm
6     cancel
7     cancel
Name: state, dtype: object

In [100]:
# 하지만 위에서는 변형된 결과를 기존 메모리에 할당하지 않는다
# 기존 데이터에 덮어쓰기 위해서는 분명히 명시해줘야한다.

order['state'] = order['state'].replace('confirmed','confirm').replace("canceled", "cancel")

In [62]:
order

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

In [24]:
# pandas는 어떤 데이터가 0-9이면 숫자, 나머지는 문자열로 간주한다.
# pandas에게 이 컬럼은 날짜 컬럼이라는 것을 알려줄 수 있는 함수가 있다.
# 이렇게되면, 판다스는 해당 컬럼을 문자열이 아닌, 날짜라는 특수한 자료형으로 취급한다.

order['date']

id
1    2017-01-01
2    2017-01-03
3    2017-01-03
4    2017-01-07
5    2017-01-09
6    2017-01-09
7    2017-01-10
Name: date, dtype: object

In [25]:
order['date'] = pd.to_datetime(order['date'])

order['date'].dt.year # month / day

id
1    2017
2    2017
3    2017
4    2017
5    2017
6    2017
7    2017
Name: date, dtype: int64

In [26]:
order['date'].dt.month

id
1    1
2    1
3    1
4    1
5    1
6    1
7    1
Name: date, dtype: int64

In [27]:
order['date'].dt.day

id
1     1
2     3
3     3
4     7
5     9
6     9
7    10
Name: date, dtype: int64

# 1-12 Column 접근법

### 행렬 검색하기 (행렬 슬라이싱)

In [63]:
order

    user_id  product_id       date  amount  address    state
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

In [67]:
order["user_id"]

id
1    3
2    1
3    3
4    4
5    7
6    5
7    2
Name: user_id, dtype: int64

In [64]:
order[["user_id", "date", "amount"]]

    user_id       date  amount
id
1         3 2017-01-01     500
2         1 2017-01-03     700
3         3 2017-01-03     900
4         4 2017-01-07     500
5         7 2017-01-09     700
6         5 2017-01-09     600
7         2 2017-01-10     200

In [70]:
type(order['user_id'])

pandas.core.series.Series

In [71]:
type(order[['user_id', "date", "amount"]])

pandas.core.frame.DataFrame

# 1-13 Row 접근법

In [76]:
order.loc[1]

user_id                         3
product_id                      9
date          2017-01-01 00:00:00
amount                        500
address                     Seoul
state                     confirm
Name: 1, dtype: object

In [84]:
order.loc[1:3]

    user_id  product_id       date  amount  address    state
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm

In [85]:
type(order.loc[1])

pandas.core.series.Series

In [86]:
type(order.loc[1:3])

pandas.core.frame.DataFrame

# 1-14 Pandas에서 행렬을 동시에 접근하는 방법

In [87]:
order.loc[1]['date'] # 이건 시간복잡도가 늘어나

Timestamp('2017-01-01 00:00:00')

In [89]:
order.loc[1, 'date'] # 이 방법이 더 낫지 속도가 빨라!

Timestamp('2017-01-01 00:00:00')

In [93]:
order.at[1, 'date']

Timestamp('2017-01-01 00:00:00')

In [90]:
%timeit order.loc[1]['date']

523 µs ± 51.6 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [100]:
%timeit order.loc[1, 'date']

21.6 µs ± 3.29 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [96]:
%timeit order.at[1, 'date']

18.8 µs ± 770 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

탐색 속도는 .at이 가장 빠르지만, row, column 하나씩만 접근 가능하다...

# 1-15 판다스 인덱싱

## 인덱싱

In [30]:
order

    user_id  product_id       date  amount  address    state
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

In [29]:
order[order['date'] == '2017-01-03']

    user_id  product_id       date  amount  address    state
id
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm

In [40]:
order[order['date'] != '2017-01-03']

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

In [41]:
order[order['amount'] > 500]

    user_id  product_id        date  amount  address    state
id
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel

# Pandas Indexing 응용

In [42]:
order

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

In [43]:
date_candidates = ['2017-01-01', '2017-01-05', '2017-01-09']

date_candidates

['2017-01-01', '2017-01-05', '2017-01-09']

isin()함수를 이용해서 인덱싱 할 수 있다.

In [44]:
order['date'].isin(date_candidates)

id
1     True
2    False
3    False
4    False
5     True
6     True
7    False
Name: date, dtype: bool

In [45]:
order[order['date'].isin(date_candidates)]

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel

비어있는 null 값을 찾아내보자.

In [46]:
order

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

In [47]:
order['address'].isnull()

id
1    False
2    False
3    False
4     True
5    False
6    False
7     True
Name: address, dtype: bool

In [48]:
order[order['address'].isnull()]

    user_id  product_id        date  amount address   state
id
4         4           2  2017-01-07     500     NaN  cancel
7         2           5  2017-01-10     200     NaN  cancel

In [49]:
order['address'].notnull()

id
1     True
2     True
3     True
4    False
5     True
6     True
7    False
Name: address, dtype: bool

In [50]:
~order['address'].isnull()

id
1     True
2     True
3     True
4    False
5     True
6     True
7    False
Name: address, dtype: bool

In [51]:
order[~order['address'].isnull()]

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel

# 1-17 Pandas Indexing  다중조건 (and, &)

예를들어, vip고객을 찾는데

금액이 $500 이상이면서 state가 confirm인 사람을 찾는 경우

In [52]:
order['amount'] >= 500

id
1     True
2     True
3     True
4     True
5     True
6     True
7    False
Name: amount, dtype: bool

In [64]:
order[order['state'] == "confirm"]

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
5         7           3  2017-01-09     700  Incheon  confirm

In [55]:
order

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN  confirm
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan  confirm
7         2           5  2017-01-10     200      NaN  confirm

In [66]:
# pandas 에서는 python의 and가 먹히지 않고, 다른 문법을 써야한다.
order['amount'] >= 500 and order['state'] == 'confirm'

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [67]:
(order['amount'] >= 500) & (order['state']=='confirm')

id
1     True
2     True
3     True
4    False
5     True
6    False
7    False
dtype: bool

In [68]:
order[(order['amount'] >= 500) & (order['state']=='confirm')]

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
5         7           3  2017-01-09     700  Incheon  confirm

위 방법은 잘 먹히지만, 코드가 길어진다는 단점이 있다.

그럼 아래와 같이 조건을 변수로 지정하자.

In [69]:
high = order['amount'] >= 500
confirm = order['state'] == 'confirm'

order[high & confirm]

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
5         7           3  2017-01-09     700  Incheon  confirm

# 1-18 Pandas Indexing 다중조건2 (or, |)

In [71]:
order

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

In [70]:
order[high|confirm]

    user_id  product_id        date  amount  address    state
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel

## Row를 색인한 다음 컬럼에 접근하기

In [72]:
order[order['date']=='2017-01-09']['amount']

id
5    700
6    600
Name: amount, dtype: int64

위 방법은 pandas에서 권장되지 않는 방법이다. 콤마로 구분하자.

In [75]:
order.loc[order['date']=='2017-01-09', 'amount']

id
5    700
6    600
Name: amount, dtype: int64

# 1-19 컬럼 추가, 수정하기

추가하는 문법은 
수정하는 문법과 일치한다.

In [95]:
# 모든 내용이 같은 경우
order ['card-holder'] = "KB Card"
order

    user_id  product_id        date  amount  address      state card-holder
id
1         3           9  2017-01-01     500    Seoul  confirmed     KB Card
2         1           7  2017-01-03     700    Seoul  confirmed     KB Card
3         3           8  2017-01-03     900  Daejeon  confirmed     KB Card
4         4           2  2017-01-07     500      NaN   canceled     KB Card
5         7           3  2017-01-09     700  Incheon  confirmed     KB Card
6         5           7  2017-01-09     600    Busan   canceled     KB Card
7         2           5  2017-01-10     200      NaN   canceled     KB Card

In [96]:
# 내용을 수정하는 경우

order ['card-holder'] = "KEB Card"
order

    user_id  product_id        date  amount  address      state card-holder
id
1         3           9  2017-01-01     500    Seoul  confirmed    KEB Card
2         1           7  2017-01-03     700    Seoul  confirmed    KEB Card
3         3           8  2017-01-03     900  Daejeon  confirmed    KEB Card
4         4           2  2017-01-07     500      NaN   canceled    KEB Card
5         7           3  2017-01-09     700  Incheon  confirmed    KEB Card
6         5           7  2017-01-09     600    Busan   canceled    KEB Card
7         2           5  2017-01-10     200      NaN   canceled    KEB Card

Pandas는 갯수만 맞춰주면 알아서 넣어줌 ㅋㅋ

In [97]:
order['order'] = [i for i in range(1, 8)]
order

,user_id,product_id,date,amount,address,state,card-holder,order
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirmed,KEB Card,1
2,1,7,2017-01-03,700,Seoul,confirmed,KEB Card,2
3,3,8,2017-01-03,900,Daejeon,confirmed,KEB Card,3
4,4,2,2017-01-07,500,NaN,canceled,KEB Card,4
5,7,3,2017-01-09,700,Incheon,confirmed,KEB Card,5
6,5,7,2017-01-09,600,Busan,canceled,KEB Card,6
7,2,5,2017-01-10,200,NaN,canceled,KEB Card,7

# 1-20 컬럼 추가, 수정2

In [102]:
# amount가 $500 이상, confirm인 사람을 VIP로

order['VIP'] = (order['amount'] >= 500) & (order['state'] == 'confirm')
order

,user_id,product_id,date,amount,address,state,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KEB Card,1,True
2,1,7,2017-01-03,700,Seoul,confirm,KEB Card,2,True
3,3,8,2017-01-03,900,Daejeon,confirm,KEB Card,3,True
4,4,2,2017-01-07,500,NaN,cancel,KEB Card,4,False
5,7,3,2017-01-09,700,Incheon,confirm,KEB Card,5,True
6,5,7,2017-01-09,600,Busan,cancel,KEB Card,6,False
7,2,5,2017-01-10,200,NaN,cancel,KEB Card,7,False

In [114]:
order.loc[high & confirm, 'isVIP'] = 'VIP'
order.loc[(order['amount']<500) | (order['state'] !='confirm') , 'isVIP'] = "Non-VIP"

order

,user_id,product_id,date,amount,address,state,card-holder,order,VIP,isVIP
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KEB Card,1,VIP,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KEB Card,2,VIP,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KEB Card,3,VIP,VIP
4,4,2,2017-01-07,500,NaN,cancel,KEB Card,4,Non-VIP,Non-VIP
5,7,3,2017-01-09,700,Incheon,confirm,KEB Card,5,VIP,VIP
6,5,7,2017-01-09,600,Busan,cancel,KEB Card,6,Non-VIP,Non-VIP
7,2,5,2017-01-10,200,NaN,cancel,KEB Card,7,Non-VIP,Non-VIP

In [112]:
order.loc[(order['amount'] >= 500) & (order['state']=='confirm'), 'VIP'] = 'VIP'
order.loc[(order['amount'] < 500) | (order['state']!='confirm'), 'VIP'] = 'Non-VIP'

order

,user_id,product_id,date,amount,address,state,card-holder,order,VIP,isVIP
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KEB Card,1,VIP,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KEB Card,2,VIP,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KEB Card,3,VIP,VIP
4,4,2,2017-01-07,500,NaN,cancel,KEB Card,4,Non-VIP,VIP
5,7,3,2017-01-09,700,Incheon,confirm,KEB Card,5,VIP,VIP
6,5,7,2017-01-09,600,Busan,cancel,KEB Card,6,Non-VIP,VIP
7,2,5,2017-01-10,200,NaN,cancel,KEB Card,7,Non-VIP,Non-VIP

# 1- 21 컬럼 삭제

In [119]:
order.drop('isVIP', axis=1)

,user_id,product_id,date,amount,address,state,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KEB Card,1,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KEB Card,2,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KEB Card,3,VIP
4,4,2,2017-01-07,500,NaN,cancel,KEB Card,4,Non-VIP
5,7,3,2017-01-09,700,Incheon,confirm,KEB Card,5,VIP
6,5,7,2017-01-09,600,Busan,cancel,KEB Card,6,Non-VIP
7,2,5,2017-01-10,200,NaN,cancel,KEB Card,7,Non-VIP

In [121]:
# Pandas는 데이터 보호를 위해, drop만으로 원본 데이터를 드랍하지 않는다.
order

,user_id,product_id,date,amount,address,state,card-holder,order,VIP,isVIP
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KEB Card,1,VIP,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KEB Card,2,VIP,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KEB Card,3,VIP,VIP
4,4,2,2017-01-07,500,NaN,cancel,KEB Card,4,Non-VIP,Non-VIP
5,7,3,2017-01-09,700,Incheon,confirm,KEB Card,5,VIP,VIP
6,5,7,2017-01-09,600,Busan,cancel,KEB Card,6,Non-VIP,Non-VIP
7,2,5,2017-01-10,200,NaN,cancel,KEB Card,7,Non-VIP,Non-VIP

In [122]:
order = order.drop('isVIP', axis=1)

In [123]:
order

,user_id,product_id,date,amount,address,state,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KEB Card,1,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KEB Card,2,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KEB Card,3,VIP
4,4,2,2017-01-07,500,NaN,cancel,KEB Card,4,Non-VIP
5,7,3,2017-01-09,700,Incheon,confirm,KEB Card,5,VIP
6,5,7,2017-01-09,600,Busan,cancel,KEB Card,6,Non-VIP
7,2,5,2017-01-10,200,NaN,cancel,KEB Card,7,Non-VIP

In [124]:
order = order.drop(3, axis = 0)
order

,user_id,product_id,date,amount,address,state,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KEB Card,1,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KEB Card,2,VIP
4,4,2,2017-01-07,500,NaN,cancel,KEB Card,4,Non-VIP
5,7,3,2017-01-09,700,Incheon,confirm,KEB Card,5,VIP
6,5,7,2017-01-09,600,Busan,cancel,KEB Card,6,Non-VIP
7,2,5,2017-01-10,200,NaN,cancel,KEB Card,7,Non-VIP

# 1-22 Pandas apply, 파이썬 함수를 적용할 수 있게 하는 함수

In [138]:
order.loc[3] = [3, 8 , '2017-01-03', 900, "Daejeon", "confirm", "KEB Card", 2, "VIP", "VIP"]

In [139]:
order

,user_id,product_id,date,amount,address,state,card-holder,order,VIP,is_VIP
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KEB Card,1,VIP,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KEB Card,2,VIP,VIP
4,4,2,2017-01-07,500,NaN,cancel,KEB Card,4,Non-VIP,Non_VIP
5,7,3,2017-01-09,700,Incheon,confirm,KEB Card,5,VIP,VIP
6,5,7,2017-01-09,600,Busan,cancel,KEB Card,6,Non-VIP,Non_VIP
7,2,5,2017-01-10,200,NaN,cancel,KEB Card,7,Non-VIP,Non_VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KEB Card,2,VIP,VIP

In [130]:
order['amount']

id
1    500
2    700
4    500
5    700
6    600
7    200
3    900
Name: amount, dtype: int64

In [140]:
def is_vip(amount):
    if amount >= 500:
        return "VIP"
    else:
        return "Non-VIP"

order["is_VIP"]= order['amount'].apply(is_vip)

order

,user_id,product_id,date,amount,address,state,card-holder,order,VIP,is_VIP
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KEB Card,1,VIP,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KEB Card,2,VIP,VIP
4,4,2,2017-01-07,500,NaN,cancel,KEB Card,4,Non-VIP,VIP
5,7,3,2017-01-09,700,Incheon,confirm,KEB Card,5,VIP,VIP
6,5,7,2017-01-09,600,Busan,cancel,KEB Card,6,Non-VIP,VIP
7,2,5,2017-01-10,200,NaN,cancel,KEB Card,7,Non-VIP,Non-VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KEB Card,2,VIP,VIP

복수조건이 들어갈 때 apply 구현 방법

In [141]:
def is_vip(row):
    amount = row['amount']
    state = row['state']
    
    if (amount >= 500) and (state == "confirm") :
        return "VIP"
    else:
        return "Non_VIP"

order['is_VIP']= order.apply(is_vip, axis=1)
order

,user_id,product_id,date,amount,address,state,card-holder,order,VIP,is_VIP
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KEB Card,1,VIP,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KEB Card,2,VIP,VIP
4,4,2,2017-01-07,500,NaN,cancel,KEB Card,4,Non-VIP,Non_VIP
5,7,3,2017-01-09,700,Incheon,confirm,KEB Card,5,VIP,VIP
6,5,7,2017-01-09,600,Busan,cancel,KEB Card,6,Non-VIP,Non_VIP
7,2,5,2017-01-10,200,NaN,cancel,KEB Card,7,Non-VIP,Non_VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KEB Card,2,VIP,VIP